---
kind: type
id: T:Autodesk.Revit.DB.Structure.TrussMemberType
source: html/cb45b93c-c450-2067-d701-10654812c769.htm
---
# Autodesk.Revit.DB.Structure.TrussMemberType

Indicates the "kind" of a truss member.

## Syntax (C#)
```csharp
public enum TrussMemberType
```